In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("datasets/Bank_churn_modelling.csv")
df_backup = df
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [3]:
#remove the columns not required
df = df.drop("RowNumber", axis = 1)
df = df.drop("CustomerId", axis = 1)
df = df.drop("Surname", axis = 1)
df

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...
9995,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [5]:
#convert geography and gender column to quantitative since logistic reg takes quantitative input and gives categorical output
#split gender into gender_female and gender_male (2 separate columns) - do same with geography

In [6]:
df['Geography'] = df['Geography'].str.lower()
df['Gender'] = df['Gender'].str.lower()
df

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,france,female,42,2,0.00,1,1,1,101348.88,1
1,608,spain,female,41,1,83807.86,1,0,1,112542.58,0
2,502,france,female,42,8,159660.80,3,1,0,113931.57,1
3,699,france,female,39,1,0.00,2,0,0,93826.63,0
4,850,spain,female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...
9995,771,france,male,39,5,0.00,2,1,0,96270.64,0
9996,516,france,male,35,10,57369.61,1,1,1,101699.77,0
9997,709,france,female,36,7,0.00,1,0,1,42085.58,1
9998,772,germany,male,42,3,75075.31,2,1,0,92888.52,1
9999,792,france,female,28,4,130142.79,1,1,0,38190.78,0

In [7]:
df.describe()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [8]:
df_backup2 = df

In [9]:
df_nocategories = df.drop("Geography", axis=1)
df_nocategories = df_nocategories.drop("Gender", axis=1)
df_nocategories

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,42,2,0.00,1,1,1,101348.88,1
1,608,41,1,83807.86,1,0,1,112542.58,0
2,502,42,8,159660.80,3,1,0,113931.57,1
3,699,39,1,0.00,2,0,0,93826.63,0
4,850,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,0
9996,516,35,10,57369.61,1,1,1,101699.77,0
9997,709,36,7,0.00,1,0,1,42085.58,1
9998,772,42,3,75075.31,2,1,0,92888.52,1
9999,792,28,4,130142.79,1,1,0,38190.78,0

In [10]:
#get_dummies spilts the categorical columns into multiple columns to give quantitave values1
df  = pd.get_dummies(df)
df

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_france,Geography_germany,Geography_spain,Gender_female,Gender_male
0,619,42,2,0.00,1,1,1,101348.88,1,1,0,0,1,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,1,1,0
2,502,42,8,159660.80,3,1,0,113931.57,1,1,0,0,1,0
3,699,39,1,0.00,2,0,0,93826.63,0,1,0,0,1,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,0,1,0,0,0,1
9996,516,35,10,57369.61,1,1,1,101699.77,0,1,0,0,0,1
9997,709,36,7,0.00,1,0,1,42085.58,1,1,0,0,1,0
9998,772,42,3,75075.31,2,1,0,92888.52,1,0,1,0,0,1
9999,792,28,4,130142.79,1,1,0,38190.78,0,1,0,0,1,0

In [11]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score, recall_score, precision_score, f1_score

In [12]:
#NO_CATEGORIES MODEL

In [13]:
#split data and target columns
X_nc = df_nocategories.drop("Exited", axis=1)
Y_nc = df_nocategories["Exited"]

In [14]:
X_nc

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,42,2,0.00,1,1,1,101348.88
1,608,41,1,83807.86,1,0,1,112542.58
2,502,42,8,159660.80,3,1,0,113931.57
3,699,39,1,0.00,2,0,0,93826.63
4,850,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64
9996,516,35,10,57369.61,1,1,1,101699.77
9997,709,36,7,0.00,1,0,1,42085.58
9998,772,42,3,75075.31,2,1,0,92888.52
9999,792,28,4,130142.79,1,1,0,38190.78

In [15]:
Y_nc

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [16]:
#split into train and test samples
X_train_nc, X_test_nc, Y_train_nc, Y_test_nc = train_test_split(X_nc, Y_nc, test_size=0.20, random_state=42)
#random_state randomly shuffles the data

In [17]:
X_train_nc

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
9254,686,32,6,0.00,2,1,1,179093.26
1561,632,42,4,119624.60,2,1,1,195978.86
1670,559,24,3,114739.92,1,1,0,85891.02
6087,561,27,9,135637.00,1,1,0,153080.40
6669,517,56,9,142147.32,1,0,0,39488.04
...,...,...,...,...,...,...,...,...
5734,768,54,8,69712.74,1,1,1,69381.05
5191,682,58,1,0.00,1,1,1,706.50
5390,735,38,1,0.00,3,0,0,92220.12
860,667,43,8,190227.46,1,1,0,97508.04
7270,697,51,1,147910.30,1,1,1,53581.14

In [18]:
Y_train_nc

9254    0
1561    0
1670    1
6087    1
6669    1
       ..
5734    0
5191    0
5390    1
860     1
7270    0
Name: Exited, Length: 8000, dtype: int64

In [19]:
model_nc = LogisticRegression()
model_nc.fit(X_train_nc,Y_train_nc)

LogisticRegression()

In [20]:
Y_pred_nc = model_nc.predict(X_test_nc)

In [21]:
conf_nc = confusion_matrix(Y_test_nc, Y_pred_nc)
conf_nc

array([[1573,   34],
       [ 365,   28]])

In [22]:
accuracy_nc = (conf_nc[0][0]+conf_nc[1][1])/(conf_nc[0][0]+conf_nc[0][1]+conf_nc[1][0]+conf_nc[1][1])
accuracy_nc

0.8005

In [23]:
accuracy_score(Y_test_nc, Y_pred_nc)

0.8005

In [24]:
recall_score(Y_test_nc, Y_pred_nc)

0.07124681933842239

In [25]:
precision_score(Y_test_nc, Y_pred_nc)

0.45161290322580644

In [26]:
f1_score(Y_test_nc, Y_pred_nc)

0.12307692307692307

In [27]:
#model with categories (geography and gender)

In [28]:
X = df.drop("Exited", axis=1)
Y = df["Exited"]

In [29]:
X

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_france,Geography_germany,Geography_spain,Gender_female,Gender_male
0,619,42,2,0.00,1,1,1,101348.88,1,0,0,1,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,1,1,0
2,502,42,8,159660.80,3,1,0,113931.57,1,0,0,1,0
3,699,39,1,0.00,2,0,0,93826.63,1,0,0,1,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,1,0,0,0,1
9996,516,35,10,57369.61,1,1,1,101699.77,1,0,0,0,1
9997,709,36,7,0.00,1,0,1,42085.58,1,0,0,1,0
9998,772,42,3,75075.31,2,1,0,92888.52,0,1,0,0,1
9999,792,28,4,130142.79,1,1,0,38190.78,1,0,0,1,0

In [30]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.20, random_state=42)

In [31]:
model = LogisticRegression()
model.fit(X_train,Y_train )

LogisticRegression()

In [32]:
Y_pred = model.predict(X_test)

In [33]:
accuracy = accuracy_score(Y_test, Y_pred)
accuracy

0.8005

In [34]:
accuracy_score(Y_test, Y_pred)

0.8005

In [35]:
recall_score(Y_test, Y_pred)

0.07124681933842239

In [36]:
precision_score(Y_test, Y_pred)

0.45161290322580644

In [37]:
f1_score(Y_test, Y_pred)

0.12307692307692307

In [38]:
confusion_matrix(Y_test, Y_pred)

array([[1573,   34],
       [ 365,   28]])